InformationRegisters/ОтправкиОтчетностиКОбработке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОтправкиОтчетностиКОбработке</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтправкиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребуетАудита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/РабочийСтолОператораОтправки/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// восстанавливаем режим отображения списка областей данных
	ПоказыватьОбластиДанных = ХранилищеОбщихНастроек.Загрузить("ОбщаяФормаРабочийстолОператораОтправки", "РежимОтображенияОбластейДанных");
	Если ПоказыватьОбластиДанных <> "0" И ПоказыватьОбластиДанных <> "1" И ПоказыватьОбластиДанных <> "2" Тогда
		ПоказыватьОбластиДанных = "0";
	КонецЕсли;
	
	// регулируем пометку подменю
	Если ПоказыватьОбластиДанных = "0" Тогда
		Элементы.ОбластиДанныхКнопкаОтображатьТребующиеАудита.Пометка = Истина;
	ИначеЕсли ПоказыватьОбластиДанных = "1" Тогда
		Элементы.ОбластиДанныхКнопкаОтображатьСОтчетностьюВОбработке.Пометка = Истина;
	ИначеЕсли ПоказыватьОбластиДанных = "2" Тогда
		Элементы.ОбластиДанныхКнопкаОтображатьВсе.Пометка = Истина;
	КонецЕсли;
	
	// прячем группу с информацией из областей данных пользователей
	Элементы.ГруппаПравая.ТекущаяСтраница = Элементы.ГруппаПраваяПустая;
	Элементы.ГруппаПраваяОтчетность.Видимость = Ложь;
	
	ЗаполнитьОбластиДанных();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ОбластиДанныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВойтиВВыбраннуюОбласть();
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацииВИФНСВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "РегистрацииВИФНСДоверенность" Тогда
		СтандартнаяОбработка = Ложь;
		Если Элемент.ТекущиеДанные <> Неопределено И Элемент.ТекущиеДанные.Доверенность <> Неопределено Тогда
			ПоказатьЗначение(, Элемент.ТекущиеДанные.Доверенность);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВойтиВВыбраннуюОбласть(Команда = Неопределено)
	
	ТекСтрока = Элементы.ОбластиДанных.ТекущаяСтрока;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтрокаРеквизита = ОбластиДанных.НайтиПоИдентификатору(ТекСтрока);
	Если ТекСтрокаРеквизита = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВойтиВОбластьДанныхНаСервере(ТекСтрокаРеквизита.Разделитель);
	
	Элементы.КнопкаВыйти.Видимость = Истина;
	
	// считываем данные панели Отчетность заново
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ТаблицаФормыОбновить(Элементы.ОтправкиОтчетности);
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ТаблицаФормыОбновить(Элементы.СобытияОтправкиОтчетности);
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ТаблицаФормыОбновить(Элементы.РегистрацииВИФНС);
	
	Элементы.ГруппаПраваяОтчетность.Видимость = Истина;
	Элементы.ГруппаПравая.ТекущаяСтраница = Элементы.ГруппаПраваяОтчетность;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьВсеОбластиДанных(Команда)
	
	Элементы.ОбластиДанныхКнопкаОтображатьВсе.Пометка = Истина;
	Элементы.ОбластиДанныхКнопкаОтображатьСОтчетностьюВОбработке.Пометка = Ложь;
	Элементы.ОбластиДанныхКнопкаОтображатьТребующиеАудита.Пометка = Ложь;
	
	НовыйПоказыватьОбластиДанных = "2";
	
	Если НовыйПоказыватьОбластиДанных <> ПоказыватьОбластиДанных Тогда
		ПоказыватьОбластиДанных = НовыйПоказыватьОбластиДанных;
		ЗаполнитьОбластиДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьОбластиДанныхСОтчетностьюВОбработке(Команда)
	
	Элементы.ОбластиДанныхКнопкаОтображатьВсе.Пометка = Ложь;
	Элементы.ОбластиДанныхКнопкаОтображатьСОтчетностьюВОбработке.Пометка = Истина;
	Элементы.ОбластиДанныхКнопкаОтображатьТребующиеАудита.Пометка = Ложь;
	
	НовыйПоказыватьОбластиДанных = "1";
	
	Если НовыйПоказыватьОбластиДанных <> ПоказыватьОбластиДанных Тогда
		ПоказыватьОбластиДанных = НовыйПоказыватьОбластиДанных;
		ЗаполнитьОбластиДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьОбластиТребующиеАудита(Команда)
	
	Элементы.ОбластиДанныхКнопкаОтображатьВсе.Пометка = Ложь;
	Элементы.ОбластиДанныхКнопкаОтображатьСОтчетностьюВОбработке.Пометка = Ложь;
	Элементы.ОбластиДанныхКнопкаОтображатьТребующиеАудита.Пометка = Истина;
	
	НовыйПоказыватьОбластиДанных = "0";
	
	Если НовыйПоказыватьОбластиДанных <> ПоказыватьОбластиДанных Тогда
		ПоказыватьОбластиДанных = НовыйПоказыватьОбластиДанных;
		ЗаполнитьОбластиДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
	
	ОткрытьФорму("ОбщаяФорма.НастройкиСдачиОтчетностиЧерезСервисСпецоператора",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНаправленияСдачиОтчетности(Команда)
	
	ОткрытьФорму("Справочник.НаправленияСдачиОтчетности.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОбластиДанных(Команда)
	
	ЗаполнитьОбластиДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЖурналРегистрации(Команда)
	
	ОткрытьФорму("Обработка.ЖурналРегистрации.Форма.ЖурналРегистрации");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыйтиИзОбластиДанных(Команда)
	
	ВыключитьИспользованиеРазделителя();
	Элементы.КнопкаВыйти.Видимость = Ложь;
	Элементы.ГруппаПраваяОтчетность.Видимость = Ложь;
	Элементы.ГруппаПравая.ТекущаяСтраница = Элементы.ГруппаПраваяПустая;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОбластиДанных()
	
	ТекДанные = Элементы.ОбластиДанных.ТекущаяСтрока;
	Если ТекДанные <> Неопределено Тогда
		ТекСтрокаРазделитель = ОбластиДанных.НайтиПоИдентификатору(ТекДанные).Разделитель;
	КонецЕсли;
	
	ОбластиДанных.Очистить();
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда
		Возврат;	
	КонецЕсли;
	
	МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
	
	ИспользуемыеОбластиДанных = МодульРаботаВМоделиСервиса.ИспользуемыеПользователямиОбластиДанных();
    ПредставлениеОбластиДанных = МодульРаботаВМоделиСервиса.ПолучитьИмяПриложения();
	
	Если ПредставлениеОбластиДанных = "" Тогда
		Возврат;	
	КонецЕсли;
  
	Если ПоказыватьОбластиДанных = "2" Тогда // все
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	&ПредставлениеОбластиДанных КАК Представление,
		                      |	ОтправкиКОбработке.ОбластьДанных КАК Разделитель,
		                      |	ОтправкиКОбработке.ТребуетАудита КАК ТребуетАудита
		                      |ИЗ
		                      |	(ВЫБРАТЬ
		                      |		ОтправкиОтчетностиКОбработке.ОбластьДанныхВспомогательныеДанные КАК ОбластьДанных,
		                      |		МАКСИМУМ(ОтправкиОтчетностиКОбработке.ТребуетАудита) КАК ТребуетАудита
		                      |	ИЗ
		                      |		РегистрСведений.ОтправкиОтчетностиКОбработке КАК ОтправкиОтчетностиКОбработке
		                      |	ГДЕ
		                      |		ОтправкиОтчетностиКОбработке.Идентификатор <> """"
		                      |	
		                      |	СГРУППИРОВАТЬ ПО
		                      |		ОтправкиОтчетностиКОбработке.ОбластьДанныхВспомогательныеДанные) КАК ОтправкиКОбработке
		                      |ГДЕ
		                      |	ОтправкиКОбработке.ОбластьДанных В(&ОбластиДанных)
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Разделитель");
		
		Запрос.УстановитьПараметр("ОбластиДанных", ИспользуемыеОбластиДанных);
		Запрос.УстановитьПараметр("ПредставлениеОбластиДанных", ПредставлениеОбластиДанных);
		
	ИначеЕсли ПоказыватьОбластиДанных = "1" Тогда // все незавершенные
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	&ПредставлениеОбластиДанных КАК Представление,
		                      |	ОтправкиОтчетностиКОбработке.ОбластьДанныхВспомогательныеДанные КАК Разделитель,
		                      |	ОтправкиОтчетностиКОбработке.ТребуетАудита КАК ТребуетАудита
		                      |ИЗ
		                      |	(ВЫБРАТЬ
		                      |		ОтправкиОтчетностиКОбработке.ОбластьДанныхВспомогательныеДанные КАК ОбластьДанныхВспомогательныеДанные,
		                      |		МАКСИМУМ(ОтправкиОтчетностиКОбработке.ТребуетАудита) КАК ТребуетАудита
		                      |	ИЗ
		                      |		РегистрСведений.ОтправкиОтчетностиКОбработке КАК ОтправкиОтчетностиКОбработке
		                      |	
		                      |	СГРУППИРОВАТЬ ПО
		                      |		ОтправкиОтчетностиКОбработке.ОбластьДанныхВспомогательныеДанные) КАК ОтправкиОтчетностиКОбработке
		                      |ГДЕ
		                      |	ОтправкиОтчетностиКОбработке.ОбластьДанныхВспомогательныеДанные В(&ОбластиДанных)");
		
		Запрос.УстановитьПараметр("ОбластиДанных", ИспользуемыеОбластиДанных);
		Запрос.УстановитьПараметр("ПредставлениеОбластиДанных", ПредставлениеОбластиДанных);
		
	ИначеЕсли ПоказыватьОбластиДанных = "0" ИЛИ ПоказыватьОбластиДанных = "" Тогда // все, требующие аудита
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	ОтправкиОтчетностиКОбработке.ОбластьДанныхВспомогательныеДанные КАК Разделитель,
		                      |	&ПредставлениеОбластиДанных КАК Представление,
		                      |	ИСТИНА КАК ТребуетАудита
		                      |ИЗ
		                      |	РегистрСведений.ОтправкиОтчетностиКОбработке КАК ОтправкиОтчетностиКОбработке
		                      |ГДЕ
		                      |	ОтправкиОтчетностиКОбработке.ТребуетАудита = ИСТИНА
		                      |	И ОтправкиОтчетностиКОбработке.ОбластьДанныхВспомогательныеДанные В(&ОбластиДанных)
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Разделитель");
		
		Запрос.УстановитьПараметр("ОбластиДанных", ИспользуемыеОбластиДанных);
		Запрос.УстановитьПараметр("ПредставлениеОбластиДанных", ПредставлениеОбластиДанных);
		
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтр = ОбластиДанных.Добавить();
		НовСтр.Представление = СокрЛП(Выборка.Представление);
		НовСтр.Разделитель = Выборка.Разделитель;
		НовСтр.СуществуютНезавершенныеОтправки = (Выборка.ТребуетАудита <> NULL);
		НовСтр.ТребуетАудита = (Выборка.ТребуетАудита = ИСТИНА);
	КонецЦикла;
	
	Если ТекСтрокаРазделитель <> Неопределено Тогда
		ТекСтроки = ОбластиДанных.НайтиСтроки(Новый Структура("Разделитель", ТекСтрокаРазделитель));
		Если ТекСтроки.Количество() > 0 Тогда
			Элементы.ОбластиДанных.ТекущаяСтрока = ТекСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
Конецпроцедуры

&НаСервере
Процедура ВойтиВОбластьДанныхНаСервере(Знач ЗначениеРазделителя)
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		МодульРаботаВМоделиСервиса.ВойтиВОбластьДанных(ЗначениеРазделителя);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыключитьИспользованиеРазделителя()
	
	Если ОбщегоНазначения.ПодсистемаСуществует("ТехнологияСервиса.БазоваяФункциональность") Тогда
		МодульРаботаВМоделиСервиса = ОбщегоНазначения.ОбщийМодуль("РаботаВМоделиСервиса");
		МодульРаботаВМоделиСервиса.ВыйтиИзОбластиДанных();
	КонецЕсли;
	
	РазделительТекущейОбласти = 0;
	
КонецПроцедуры

#КонецОбласти
